package ua.hillel.karhapoltseva.lessons.lesson7;

import java.lang.reflect.Array;
import java.util.Arrays;

public class Exersice_6 {
    public static void main(String[] args) {
        String[] array = {"Привіт, "+"світ"+"!"};
        System.out.println(Arrays.toString(array));
    }
}
//Дан масив з елементами 'Привіт, ', 'світ' і '!'. Необхідно вивести на екран фразу 'Привіт, світ!'.